app/controllers/games_controller.rb

  def index
    # binding.pry
    @games = Game.all
---
SELECT "games".* FROM "games"

  def get_games
    if params[:date]
      # p "inside date"
      month = params[:date].split("-")[0]
      # p month
      day = params[:date].split("-")[1]
      # p day
      @games = Game.where('extract(month  from scheduled) = ? AND extract(day  from scheduled) = ?', month, day).where.not(lat: nil)
---
SELECT "games".* FROM "games" WHERE (extract(month  from scheduled) = 'april' AND extract(day  from scheduled) = 'undefined') AND "games"."lat" IS NOT NULL